[
  {
    "id": 1,
    "name": "Attack on Titan",
    "description": "A brutal world under siege by towering Titans. Eren Yeager joins the military to avenge his family and discover the truth about the Titans.",
    "price": 900,
    "quantity": 139,
    "imageUrl": "imag_1",
    "author": "Hajime Isayama",
    "genre": "Action, Drama",
    "rating": 9.0,
    "chapters": 139,
    "fullSummary": "Attack on Titan follows Eren Yeager in a world where humanity hides behind walls to protect itself from Titans—giant humanoid creatures. After his mother is killed, Eren vows revenge. The story reveals hidden political conspiracies and mysteries about the Titans, challenging morality and survival."
  },
  {
    "id": 2,
    "name": "Naruto",
    "description": "Naruto Uzumaki, a misfit ninja, dreams of becoming Hokage to earn respect. But a demon fox sealed inside him complicates his journey.",
    "price": 880,
    "quantity": 700,
    "imageUrl": "2.jpg",
    "author": "Masashi Kishimoto",
    "genre": "Action, Adventure",
    "rating": 8.8,
    "chapters": 700,
    "fullSummary": "Naruto tells the tale of a boy shunned by his village for harboring a demon inside him. Through grit and determination, Naruto trains to become a great ninja and earn everyone's acknowledgment. The series emphasizes friendship, rivalry, and growth."
  },
  {
    "id": 3,
    "name": "One Piece",
    "description": "Monkey D. Luffy sets out to become the Pirate King by finding the legendary treasure known as One Piece.",
    "price": 920,
    "quantity": 1100,
    "imageUrl": "3.jpg",
    "author": "Eiichiro Oda",
    "genre": "Adventure, Fantasy",
    "rating": 9.2,
    "chapters": 1100,
    "fullSummary": "One Piece is an epic pirate adventure. Luffy, a rubber-powered boy, travels across seas with his diverse crew. They face powerful enemies, uncover secrets of ancient history, and battle for freedom, all in pursuit of the fabled One Piece treasure."
  },
  {
    "id": 4,
    "name": "Death Note",
    "description": "Light Yagami discovers a notebook that kills anyone whose name is written in it. He attempts to cleanse the world of evil.",
    "price": 910,
    "quantity": 108,
    "imageUrl": "4.jpg",
    "author": "Tsugumi Ohba",
    "genre": "Mystery, Thriller",
    "rating": 9.1,
    "chapters": 108,
    "fullSummary": "Death Note is a psychological battle between Light Yagami, who believes in his divine mission to kill criminals, and L, a mysterious detective. It explores justice, morality, and the consequences of unchecked power."
  },
  {
    "id": 5,
    "name": "Demon Slayer",
    "description": "Tanjiro Kamado fights demons and protects his sister Nezuko after their family is slaughtered.",
    "price": 870,
    "quantity": 205,
    "imageUrl": "5.jpg",
    "author": "Koyoharu Gotouge",
    "genre": "Action, Supernatural",
    "rating": 8.7,
    "chapters": 205,
    "fullSummary": "Demon Slayer follows Tanjiro’s mission to hunt demons and find a cure for his demon-turned sister. Along the way, he joins the Demon Slayer Corps and faces emotionally complex enemies with tragic backstories."
  },
  {
    "id": 6,
    "name": "Jujutsu Kaisen",
    "description": "Yuji Itadori gains cursed powers after swallowing a demon's finger and enters a world of jujutsu sorcerers.",
    "price": 850,
    "quantity": 9,
    "imageUrl": "6.jpg",
    "author": "Gege Akutami",
    "genre": "Action, Supernatural",
    "rating": 8.5,
    "chapters": 250,
    "fullSummary": "Jujutsu Kaisen dives into a world where cursed energy creates monsters. Yuji hosts the King of Curses—Sukuna—and must fight evil spirits while maintaining his humanity. The series explores death, sacrifice, and inner demons."
  },
  {
    "id": 7,
    "name": "Bleach",
    "description": "Ichigo Kurosaki becomes a Soul Reaper and defends the living world from evil spirits known as Hollows.",
    "price": 830,
    "quantity": 686,
    "imageUrl": "7.jpg",
    "author": "Tite Kubo",
    "genre": "Action, Supernatural",
    "rating": 8.3,
    "chapters": 686,
    "fullSummary": "Bleach follows Ichigo, a teenager who gains the powers of a Soul Reaper. He protects the living and battles spirits, rival clans, and internal corruption. It blends sword battles with deep emotional stakes."
  },
  {
    "id": 8,
    "name": "Tokyo Ghoul",
    "description": "Kaneki transforms into a half-ghoul and must navigate the violent world of human-eating creatures.",
    "price": 840,
    "quantity": 179,
    "imageUrl": "8.jpg",
    "author": "Sui Ishida",
    "genre": "Dark Fantasy",
    "rating": 8.4,
    "chapters": 179,
    "fullSummary": "Tokyo Ghoul is a dark tale of identity. Kaneki, once human, is forced to live among flesh-eating ghouls while struggling to retain his humanity. The story is filled with psychological tension and questions about morality."
  },
  {
    "id": 9,
    "name": "Fullmetal Alchemist",
    "description": "Two brothers use alchemy in a quest to restore their bodies after a failed resurrection.",
    "price": 920,
    "quantity": 116,
    "imageUrl": "9.jpg",
    "author": "Hiromu Arakawa",
    "genre": "Adventure, Sci-Fi",
    "rating": 9.2,
    "chapters": 116,
    "fullSummary": "Fullmetal Alchemist explores the journey of Edward and Alphonse Elric. After a forbidden ritual costs them dearly, they seek the Philosopher’s Stone while facing war, politics, and the consequences of human transmutation."
  },
  {
    "id": 10,
    "name": "Dragon Ball",
    "description": "Follow Goku's rise from a cheerful boy to the universe’s most powerful warrior.",
    "price": 860,
    "quantity": 519,
    "imageUrl": "10.jpg",
    "author": "Akira Toriyama",
    "genre": "Action, Fantasy",
    "rating": 8.6,
    "chapters": 519,
    "fullSummary": "Dragon Ball follows Goku's evolution through martial arts, friendships, rivalries, and cosmic battles. It begins with a lighthearted tone and grows into an epic saga of gods, tournaments, and universe-saving missions."
  }
]